{ 
  "name": "de",
  "fields" : {
    "algorithm_btn_prev": "Zurück",
    "algorithm_btn_next": "Nächster Schritt",
    "algorithm_btn_frwd": "Vorspulen",
    "algorithm_btn_paus": "Pause",
    "algorithm_msg_finish": "Was nun?",
    "algorithm_msg_test": "Forschungsaufgaben ausprobieren:",
    "algorithm_btn_more": "Beschreibung des Algorithmus lesen",
    "algorithm_btn_exe1": "Wie würde der Algorithmus entscheiden?",
    "algorithm_btn_exe2": "Finde die Augmentationswege",
    "algorithm_btn_match": "Zeige das Matching",
    "algorithm_btn_match1": "Zeige den Graph",
    "algorithm_status1": "Kosten des Anfangsknotens: ",
    "algorithm_status2": "Kosten der Kante: ",
    "algorithm_status3": "Kosten des Zielknotens: ",
    "algorithm_status4": "Die Kosten des Zielknotens müssen aktualisiert werden.",
    "algorithm_status5": "Die Kosten des Zielknotens können nicht aktualisiert werden.",
    "textdb_text_oneedge": "eine Kante",
    "textdb_text_edges": "Kanten",
    "textdb_text_phase": "Phase",
    "textdb_text_of": "von",
    "textdb_text_iteration": "Phase",

    "textdb_msg_init": "Initialisierung",
    "textdb_msg_init_1": "Am Anfang des Algorithmus besitzen alle Knoten keinen Matching-Partner. Die Menge der Kanten im Matching M ist dementsprechend leer.",
    "textdb_msg_init_2": "In jeder Iteration suchen wir eine maximale Menge an kürzesten knotendisjunkten Augmentationswegen.",
    "textdb_msg_init_3": "Maximal heißt hier, dass es zusätzlich zu den gefundenen Pfaden keinen anderen kürzesten knotendisjunkten Augmentationsweg gibt.",

    "textdb_msg_begin_it": "Beginn der nächsten Phase",
    "textdb_msg_begin_it_1": "Es wird nach einer inklusions-maximalen Menge von kürzesten knotendisjunkten Augmentationswegen gesucht. Wenn kein solcher Augmentationsweg gefunden werden kann, endet diese Phase.",
    "textdb_msg_begin_it_2": "In dieser Phase werden nur Augmentationswege dieser Länge betrachtet. Die knotendisjunkten Augmentationswege werden nacheinander aufgezeigt.",
    "textdb_msg_begin_it_3": "Da die Augmentationswege knotendisjunkt sind, ist es nicht wichtig in welcher Reihenfolge die Wege benutzt werden, um das Matching zu augmentieren. Aus Gründen der Übersichtlichkeit  wird das Matching gleich nach Aufzeigen eines Augmentationsweges augmentiert.",
    "textdb_msg_end_it": "Ende der Phase",
    "textdb_msg_end_it_1": "Es gibt keine weiteren knotendisjunkten Augmentationswege der Länge ",
    "textdb_msg_end_it_2": "Falls es weitere Augmentationswege gibt, müssen diese länger sein und werden in den nächsten Phasen gefunden.",

    "textdb_msg_end_algo": "Algorithmus Ende",
    "textdb_msg_end_algo_1": "Es konnten keine Augmentationswege mehr gefunden werden. Der Algorithmus terminiert und gibt das aktuellen Matching aus.",
    "textdb_msg_end_algo_2": "Es gibt keine Augmentationswege mehr. Demzufolge ist das aktuelle Matching optimal.",

    "textdb_msg_path": "Finde einen kürzesten augmentierenden Pfad",
    "textdb_msg_path_1a": "Zuerst wird mittels der Breitensuche ein gerichteter Graph aufgebaut, der alle kürzesten verbessernden Pfade enthält.",
    "textdb_msg_path_1b": "Die Suche startet mit allen freien Knoten auf der linken Seite.",
    "textdb_msg_path_1c": "Es werden nur Kanten verfolgt, die nicht zum Matching gehören, da diese Knoten frei sind.",

    "textdb_msg_path_shortest": "Die Länge des kürzesten Augmentationsweges beträgt: ",

    "textdb_msg_path_highlight": "Suche nach einem Augmentationsweg",
    "textdb_msg_path_highlight_1": "Es wurde ein kürzester Augmentationsweg gefunden, der bezüglich der bereits gefundenen Wege knotendisjunkt ist.",
    "textdb_msg_path_highlight_2": "Der hervorgehobene Augmentationsweg besitzt die minimale Länge und benutzt nur Knoten, die in dieser Iteration noch nicht benutzt wurden.",

    "textdb_msg_update": "Aktualisieren des Matchings",
    "textdb_msg_update_1": "Das Matching wird mit dem gefundenen Augmentationsweg augmentiert. Die ungematchten Kanten des Augmentationsweges werden zum Matching hinzugefügt und die Matching-Kanten des Weges werden aus dem Matching entfernt.",
    "textdb_msg_update_2": "Die Anzahl der Nicht-Matching-Kanten eines Augmentationsweges ist um eins höher als die Anzal der Matching-Kanten des Weges. Deshalb erhöht sich die Kardinalität des Matchings genau um eins.",

    "textdb_msg_gray": "Ausblenden von benutzten Knoten",
    "textdb_msg_gray_1": "Die Knoten, die im aktuellen Augmentationsweg vorkommen, dürfen nicht in anderen Augmentationswegen der aktuellen Phase vorkommen. Deshalb werden sie ausgeblendet.",

    "textdb_msg_case4_1": "Ergebnis: Algorithmus erfolgreich beendet",
    "textdb_msg_case5_1": "Jetzt kann der Algorithmus beginnen!",

    "aufgabe1_qst": "Frage",
    "aufgabe1_qst_solution": "Lösung",
    "aufgabe1_qst_answer": "Antworten",
    "aufgabe1_qst_close": "Schließen",
    "aufgabe1_qst_correct": "korrekt",
    "aufgabe1_qst_wrong": "falsch",
    "aufgabe1_qst_correctanswer": "Die korrekte Antwort ist: ",
    "aufgabe1_qst_continue": "Weiter",
    "aufgabe1_btn_next_question": "Zur nächsten Frage vorspulen",
    "aufgabe1_btn_retry": "Nochmal versuchen",
    "aufgabe1_btn_exe2": "Probiere die zweite Forschungaufgabe:",
    "aufgabe1_question1": "Wie lang ist der kürzeste Augmentationsweg?",
    "aufgabe1_answer1": "Unendlich",
    "aufgabe1_answer1_reason0": "Es gibt keinen weiteren Augmentationsweg. Aus diesem Grund ist das Matching optimal und der Algorithmus terminiert.",
    "aufgabe1_answer1_reason1": "Der Algorithmus hat noch keine Berechnungen durchgeführt und es existiert mindesten eine Kante. Dann ist die Länge des kürzesten Augmentationsweges 1.",
    "aufgabe1_answer1_reason2": "Es existiert kein Augmentationsweg mit einer kürzeren Länge. Ein Augmentationsweg mit dieser Länge wird eingeblendet.",
    "aufgabe1_question2": "Wie viele Kanten überdeckt das Matching nach diesem Augmentationsschritt?",
    "aufgabe1_answer2_reason0": "Nach jedem Augmentationsschritt erhöht sich die Kardinalität des Matchings genau um 1.",
    "aufgabe1_question3": "Ist die gestrichelte Kante nach dem Augmentationsschritt im Matching?",
    "aufgabe1_answer3_reason0": "Die Kante befindet sich auf dem Augmentationsweg, ist aber aktuell im Matching enthalten. Im nächsten Schritt wird sie aus dem Matching entfernt, da die Kanten auf dem Augmentationsweg vertauscht werden.",
    "aufgabe1_answer3_reason1": "Die Kante befindet sich auf dem Augmentationsweg und ist nicht im Matching enthalten. Im nächsten Schritt wird sie zum Matching hinzugefügt, da die Kanten auf dem Augmentationsweg vertauscht werden.",
    "aufgabe1_answer3_reason2": "Die Kante befindet sich nicht auf dem Augmentationsweg. Deshalb ist sie von dem nächsten Augmentationsschritt nicht betroffen.",
    "aufgabe1_text_yes": "Ja",
    "aufgabe1_text_no": "Nein",
    "aufgabe1_text_infinity": "Unendlich",
    "aufgabe1_text_question": "Frage",
    "aufgabe1_text_results": "Ergebnisse",
    "aufgabe1_text_right_answer": "Richtige Antwort:",
    "aufgabe1_result1": "Herzlichen Glückwunsch!",
    "aufgabe1_result2": "Du hast alle Fragen korrekt beantwortet.",
    "aufgabe1_result3": "Forschungsaufgabe beendet",
    "aufgabe1_result4": "Anzahl Fragen:",
    "aufgabe1_result5": "Richtig beantwortet:",
    "aufgabe1_result6": "Falsch beantwortet:",

    "aufgabe2_btn_rev": "Letzte Auswahl rückgängig machen",
    "aufgabe2_btn_more": "Weitere Informationen über den Algorithmus",
    "aufgabe2_header": "Zeichne einen Augmentationsweg ein",
    "aufgabe2_legend": "Mit einem Linksklick wählst du die Knoten aus und mit einem Rechtsklich kann du deine Wahl rückgängigmachen.",
    "aufgabe2_path": "Klicke auf die Knoten um einen Augmentationsweg einzuzeichnen. Klicke dabei in der Reihenfolge auf die Knoten, wie sie in dem Augmentationsweg vorkommen.",
    "aufgabe2_found": "Du hast einen Augmentationweg gefunden. Klicke auf den Button \"Nächter Schritt\", um das Matching zu aktualisieren.",
    "aufgabe2_update": "Die Kanten auf dem gefundenen Augentationsweg werden vertauscht. Die Kardinalität des Matchings wird um eins erhöht.",
    "aufgabe2_warn_1": "Ein Augmentationsweg muss immer mit einem freien Knoten anfangen.",
    "aufgabe2_warn_2": "Dieser Knoten befindet sich bereits auf dem Augmenationsweg.",
    "aufgabe2_warn_3": "Die Knoten sind über keine Kante verbunden.",
    "aufgabe2_warn_4": "Als nächstes muss der Matching-Partner ausgewählt werden.",
    "aufgabe2_result_1": "Du hast den ersten Knoten ausgewählt.",
    "aufgabe2_result_3": "Der Augmentationsweg wird um einen Knoten vergrößert.",
    "aufgabe2_end": "Der Graph enthält einen erreichbaren negativen Kreis. Da dies erst am Ende erkannt werden kann, hätte der Algorithmus alle",

    "aufgabe2_explan1": "Welche Reihenfolgen sind optimal?",
    "aufgabe2_explan2": "Leider ist es aufwendig, die optimale Reihenfolge zu finden. Es ist genauso schwierig (also langwierig), wie der Algorithmus selbst.",
    "aufgabe2_explan3": "Wofür braucht man eine gute Sortierung?",
    "aufgabe2_explan4": "In der Praxis ist es sinnvoll, den Algorithmus abzubrechen, sobald die letzte Phase keine Veränderung mehr brachte, denn dann ist das Ergebnis optimal.",
    "aufgabe2_explan5": "Es existieren heuristische Verfahren (Näherungsverfahen), die eine möglichst gute Sortierung zu ermitteln versuchen."
  }
}
